vortigont/ESPIron-PTS200/SolderingPen_ESP32S2/main.cpp
//
#include "config.h"
#include "main.h"

//
#include <Button2.h>
#include <QC3Control.h>

//
#include "FirmwareMSC.h"
#include "Languages.h"
#include "USB.h"
#include "UtilsEEPROM.h"

QC3Control QC(QC_DP_PIN, QC_DM_PIN);

#include <U8g2lib.h>  // https://github.com/olikraus/u8g2
// font
#include "PTS200_16.h"

// https://github.com/madhephaestus/ESP32AnalogRead
#include <ESP32AnalogRead.h>


#ifdef U8X8_HAVE_HW_SPI
#include <SPI.h>
#endif
#ifdef U8X8_HAVE_HW_I2C
#include <Wire.h>
#endif

//#include <PID_v1.h>  // https://github.com/wagiminator/ATmega-Soldering-Station/blob/master/software/libraries/Arduino-PID-Library.zip
#include "FastPID.h"
// (old cpp version of
// https://github.com/mblythe86/C-PID-Library/tree/master/PID_v1)
#include <EEPROM.h>  // 用于将用户设置存储到EEPROM

// 选择加速度计芯片
// #define MPU
#define LIS

/*#if defined(MPU)
  #include <MPU6050_tockn.h> //https://github.com/tockn/MPU6050_tockn
  MPU6050 mpu6050(Wire);*/

// #if defined(LIS)
#include "SparkFun_LIS2DH12.h"  //Click here to get the library: http://librarymanager/All#SparkFun_LIS2DH12
SPARKFUN_LIS2DH12 accel;  // Create instance

/*#else
  #error Wrong SENSOR type!
  #endif*/

int16_t gx = 0, gy = 0, gz = 0;
uint16_t accels[32][3];
uint8_t accelIndex = 0;
#define ACCEL_SAMPLES 32

// Define aggressive and conservative PID tuning parameters
// 定义积极和保守的PID调整参数
//double aggKp = 11, aggKi = 0.5, aggKd = 1;
//float consKp = 11, consKi = 3, consKd = 5;
float consKp = 20, consKi = 2, consKd = 3;

// Default value can be changed by user and stored in EEPROM
// 用户可以更改并存储在EEPROM中的默认值
uint16_t DefaultTemp = TEMP_DEFAULT;
uint16_t SleepTemp = TEMP_SLEEP;
uint8_t BoostTemp = TEMP_BOOST;
uint16_t time2sleep = TIME2SLEEP;
uint8_t time2off = TIME2OFF;
uint8_t timeOfBoost = TIMEOFBOOST;
uint8_t MainScrType = MAINSCREEN;
bool PIDenable = PID_ENABLE;
bool beepEnable = BEEP_ENABLE;
volatile uint8_t VoltageValue = VOLTAGE_VALUE;
bool QCEnable = QC_ENABLE;
uint8_t WAKEUPthreshold = WAKEUP_THRESHOLD;
bool restore_default_config = false;

// Default value for T12
// T12的默认值
uint16_t CalTemp[TIPMAX][4] = {TEMP200, TEMP280, TEMP360, TEMPCHP};
char TipName[TIPMAX][TIPNAMELENGTH] = {TIPNAME};
uint8_t CurrentTip = 0;
uint8_t NumberOfTips = 1;

// Variables for pin change interrupt 引脚更改中断的变量
volatile uint8_t a0, b0, c0, d0;
volatile bool ab0;
volatile int count, countMin, countMax, countStep;
volatile bool handleMoved;

// Variables for temperature control 温度控制变量
uint16_t SetTemp, ShowTemp, gap, Step;
//double Input, Output, Setpoint, RawTemp, CurrentTemp, accellTemp;
// tip smoothed temperature
float RawTemp;
// accelerometer chip temperature
float accellTemp;
long CurrentTemp;
int16_t Input, Output, Setpoint;

// Variables for voltage readings 电压读数变量
uint16_t Vcc, Vin;

// State variables 状态变量
bool inLockMode = true;
bool inSleepMode = false;
bool inOffMode = false;
bool inBoostMode = false;
bool inCalibMode = false;
bool isWorky = true;
bool beepIfWorky = true;
bool TipIsPresent = true;
bool OledClear;

// Timing variables 时间变量
uint32_t sleepmillis;
uint32_t boostmillis;
uint32_t buttonmillis;
// PID timer
uint32_t pidmillis{0};
uint32_t goneMinutes;
uint32_t goneSeconds;
uint8_t SensorCounter = 0;

// Specify variable pointers and initial PID tuning parameters
// 指定变量指针和初始PID调优参数
FastPID ctrl(consKp, consKi, consKd, 10);

// Setup u8g object depending on OLED controller
// 根据OLED控制器设置u8g对象
#if defined(SSD1306)
U8G2_SSD1306_128X64_NONAME_F_HW_I2C u8g2(U8G2_R0, /* reset=*/U8X8_PIN_NONE,
                                         /* clock=*/22, /* data=*/21);
#elif defined(SH1107)
U8G2_SH1107_64X128_F_HW_I2C u8g2(U8G2_R1, 7);
#else
#error Wrong OLED controller type!
#endif

// Buffer for drawUTF8
char F_Buffer[20];

float lastSENSORTmp = 0;
float newSENSORTmp = 0;
uint8_t SENSORTmpTime = 0;

// ADC Calibrate
uint16_t vref_adc0, vref_adc1;
ESP32AnalogRead adc_sensor;
ESP32AnalogRead adc_vin;

// Language
uint8_t language = 0;

// Hand Side
uint8_t hand_side = 0;

// MSC Firmware
FirmwareMSC MSC_Update;
bool MSC_Updating_Flag = false;

// Button2 Obj
Button2 btn;

uint32_t pwm_limit = 0;

void setup() {
  // set PD pins
  pinMode(PD_CFG_0, OUTPUT);
  pinMode(PD_CFG_1, OUTPUT);
  pinMode(PD_CFG_2, OUTPUT);

  // start from default 5 volts
  digitalWrite(PD_CFG_0, HIGH);
/*
  // request 20V configuration from PD
  digitalWrite(PD_CFG_0, LOW);
  digitalWrite(PD_CFG_1, HIGH);
  digitalWrite(PD_CFG_2, LOW);
*/

  Serial.begin(115200);
  Serial.setTxTimeoutMs(0);

  adc_sensor.attach(SENSOR_PIN);
  adc_vin.attach(VIN_PIN);

  /*#if defined(MPU)
    mpu6050.begin();
    mpu6050.calcGyroOffsets(true);*/

  // #endif

  // set the pin modes 设置引脚模式
  pinMode(SENSOR_PIN, INPUT_PULLUP);
  // pinMode(VIN_PIN, INPUT);
  pinMode(BUZZER_PIN, OUTPUT);
  // pinMode(CONTROL_PIN, OUTPUT);
  pinMode(BUTTON_P_PIN, INPUT_PULLUP);
  pinMode(BUTTON_N_PIN, INPUT_PULLUP);
  pinMode(BUTTON_PIN, INPUT_PULLUP);

  // digitalWrite(BUZZER_PIN, LOW);        // must be LOW when buzzer not in
  // use当蜂鸣器不使用时，必须是低电平

  // get default values from EEPROM 从EEPROM获取默认值
  //  if (!EEPROM.begin(EEPROM_SIZE))
  //  {
  //    Serial.println("failed to initialise EEPROM");
  //    delay(100);
  //  }
  init_EEPROM();

  // if all 3 buttons are pressed on boot, reset EEPROM configuration to defaults
  if (digitalRead(BUTTON_P_PIN) == LOW && digitalRead(BUTTON_N_PIN) == LOW &&
      digitalRead(BUTTON_PIN) == HIGH) {
    write_default_EEPROM();
  }

  // load configuration from eeprom
  getEEPROM();

  if (QCEnable) {
    QC.begin();
    delay(100);
    switch (VoltageValue) {
      case 0: {
        QC.set9V();
      } break;
      case 1: {
        QC.set12V();
      } break;
      case 2: {
        QC.set12V();
      } break;
      case 3: {
        QC.set20V();
      } break;
      case 4: {
        QC.set20V();
      } break;
      default:
        break;
    }
  }

  // request configured voltage via PD trigger
  PD_Update();

  // read supply voltages in mV 以mV为单位读取电源电压
  delay(100);
  Vin = getVIN();

