vortigont/ESPIron-PTS200/SolderingPen_ESP32S2/main.cpp
  // read and set current iron temperature 读取和设置当前的烙铁头温度
  SetTemp = DefaultTemp;
  RawTemp = denoiseAnalog(SENSOR_PIN);

  calculateTemp();

  // turn on heater if iron temperature is well below setpoint
  // 如果烙铁头温度远低于设定值，则打开加热器
  pwm_limit = POWER_LIMIT_20;
/*
  if (VoltageValue < 3) {
    pwm_limit = POWER_LIMIT_15;
  }
  if (((CurrentTemp + 20) < DefaultTemp) && !inLockMode)
    ledcWrite(CONTROL_CHANNEL, constrain(HEATER_ON, 0, pwm_limit));
*/

  // set PID output range and start the PID
  // 设置PID输出范围，启动PID
  //ctrl.SetOutputLimits(0, 255);
  ctrl.setOutputRange(0, 255);
  //ctrl.SetMode(AUTOMATIC);

  // set initial rotary encoder values 设置旋转编码器的初始值
  // a0 = PINB & 1; b0 = PIND >> 7 & 1; ab0 = (a0 == b0);
  a0 = 0;
  b0 = 0;
  setRotary(TEMP_MIN, TEMP_MAX, TEMP_STEP, DefaultTemp);

  // reset sleep timer 睡眠定时器重置
  sleepmillis = millis();

  // long beep for setup completion 安装完成时长哔哔声
  beep();
  beep();
  //  delay(2000);
  Serial.println("Soldering Pen");
  // #elif defined(LIS)
  //   u8g2.setBusClock(100000);
  Wire.begin();
  Wire.setClock(100000);  // 400000
  if (accel.begin() == false) {
    //delay(500);
    Serial.println("Accelerometer not detected.");
  }
  // lis2dh12_block_data_update_set(&(accel.dev_ctx), PROPERTY_DISABLE);
  // accel.setScale(LIS2DH12_2g);
  // accel.setMode(LIS2DH12_HR_12bit);
  // accel.setDataRate(LIS2DH12_ODR_400Hz);
  // lis2dh12_fifo_mode_set(&(accel.dev_ctx), LIS2DH12_BYPASS_MODE);

  accellTemp = getAccellTemp();
  lastSENSORTmp = getAccellTemp();
  u8g2.initDisplay();
  u8g2.begin();
  u8g2.sendF("ca", 0xa8, 0x3f);
  u8g2.enableUTF8Print();
  if(hand_side){
    u8g2.setDisplayRotation(U8G2_R3);
  }else{
    u8g2.setDisplayRotation(U8G2_R1);
  }


  // btn.begin(BUTTON_PIN);
  // btn.setDoubleClickHandler(turnOffHeater);
  // btn.setDebounceTime(25);
}

int SENSORCheckTimes = 0;
long lastMillis = 0;
long meas_cnt, meas_ms = 0;

void loop() {
  ++meas_cnt;
  if (millis() - meas_ms > 1000){
    Serial.printf("lps: %u\n", meas_cnt);
    meas_cnt = 0;
    meas_ms = millis();
  }

  long timems = millis();
  ROTARYCheck();  // check rotary encoder (temp/boost setting, enter setup menu)
                  // 检查旋转编码器(温度/升压设置，进入设置菜单)
  SLEEPCheck();  // check and activate/deactivate sleep modes
                 // 检查和激活/关闭睡眠模式

  if (SENSORCheckTimes > 1) {
    // long timems = millis();
    SENSORCheck();  // reads temperature and vibration switch of the iron
                    // 读取烙铁头的温度和振动开关
    // lastMillis = millis() - timems;
    // Serial.println(lastMillis);
    SENSORCheckTimes = 0;
  }
  SENSORCheckTimes++;

  if (timems - pidmillis > 100)
    Thermostat();  // heater control 加热器控制

  MainScreen();  // updates the main page on the OLED 刷新OLED主界面
  lastMillis = millis() - timems;
  //Serial.println(lastMillis);
}

// check rotary encoder; set temperature, toggle boost mode, enter setup menu
// accordingly 检查旋转编码器;设置温度，切换升压模式，进入设置菜单相应
void ROTARYCheck() {
  // set working temperature according to rotary encoder value
  // 根据旋转编码器值设定工作温度
  SetTemp = getRotary();

  uint8_t c = digitalRead(BUTTON_PIN);
  if (!c && c0) {
    delay(10);
    if (digitalRead(BUTTON_PIN) == c) {
      beep();
      buttonmillis = millis();
      delay(10);
      while ((!digitalRead(BUTTON_PIN)) && ((millis() - buttonmillis) < 500))
        ;
      delay(10);
      if ((millis() - buttonmillis) >= 500) {
        SetupScreen();
      } else {
        if (inLockMode) {
          inLockMode = false;
        } else {
          buttonmillis = millis();
          while ((digitalRead(BUTTON_PIN)) && ((millis() - buttonmillis) < 200))
            delay(10);
          if ((millis() - buttonmillis) >= 200) {  // single click
            if (inOffMode) {
              inOffMode = false;
            } else {
              inBoostMode = !inBoostMode;
              if (inBoostMode) {
                boostmillis = millis();
              }
              handleMoved = true;
            }
          } else {  // double click
            inOffMode = true;
          }
        }
      }
    }
  }
  c0 = c;

  // check timer when in boost mode 在升温模式时检查计时器
  if (inBoostMode && timeOfBoost) {
    goneSeconds = (millis() - boostmillis) / 1000;
    if (goneSeconds >= timeOfBoost) {
      inBoostMode = false;  // stop boost mode 停止升温模式
      beep();  // beep if boost mode is over 如果升温模式结束，会发出蜂鸣声
      beepIfWorky = true;  // beep again when working temperature is reached
                           // 当达到工作温度，会发出蜂鸣声
    }
  }
}

// check and activate/deactivate sleep modes 检查和激活/关闭睡眠模式
void SLEEPCheck() {
  if (inLockMode) {
    ;
  } else {
    if (handleMoved) {  // if handle was moved 如果手柄被移动
      u8g2.setPowerSave(0);
      if (inSleepMode) {  // in sleep or off mode? 在睡眠模式还是关机模式?
        pwm_limit = POWER_LIMIT_20;
        if (VoltageValue < 3) {
          pwm_limit = POWER_LIMIT_15;
        }
        if ((CurrentTemp + 20) <
            SetTemp)  // if temp is well below setpoint 如果温度远低于设定值
          ledcWrite(
              CONTROL_CHANNEL,
              constrain(HEATER_ON, 0, pwm_limit));  // then start the heater right
                                                // now 那现在就启动加热器
        beep();              // beep on wake-up
        beepIfWorky = true;  // beep again when working temperature is reached
                             // 当达到工作温度，会发出蜂鸣声
      }
      handleMoved = false;  // reset handleMoved flag
      inSleepMode = false;  // reset sleep flag
      //      inOffMode = false;      // reset off flag
      sleepmillis = millis();  // reset sleep timer
    }

    // check time passed since the handle was moved 检查把手被移动后经过的时间
    goneSeconds = (millis() - sleepmillis) / 1000;
    if ((!inSleepMode) && (time2sleep > 0) && (goneSeconds >= time2sleep)) {
      inSleepMode = true;
      beep();
    } else if ((!inOffMode) && (time2off > 0) &&
               ((goneSeconds / 60) >= time2off)) {
      inOffMode = true;
      u8g2.setPowerSave(1);
      beep();
    }
  }
}

// reads temperature, vibration switch and supply voltages
// 读取温度，振动开关和电源电压
void SENSORCheck() {
  /*#if defined(MPU)
    mpu6050.update();
    if (abs(mpu6050.getGyroX() - gx) > WAKEUP_THRESHOLD ||
    abs(mpu6050.getGyroY() - gy) > WAKEUP_THRESHOLD || abs(mpu6050.getGyroZ() -
    gz) > WAKEUP_THRESHOLD)
    {
      gx = mpu6050.getGyroX();
      gy = mpu6050.getGyroY();
      gz = mpu6050.getGyroZ();
      handleMoved = true;
      Serial.println("进入工作状态!");
    }*/
  // #if defined(LIS)

  // if (abs(accel.getX() - gx) > WAKEUPthreshold ||
  //     abs(accel.getY() - gy) > WAKEUPthreshold ||
  //     abs(accel.getZ() - gz) > WAKEUPthreshold) {
  //   gx = accel.getX();
  //   gy = accel.getY();
  //   gz = accel.getZ();
  //   handleMoved = true;
  //   //    Serial.println("进入工作状态!");
  // }

  // accel.getRawX() return int16_t

