vortigont/ESPIron-PTS200/SolderingPen_ESP32S2/main.cpp
  if (accel.available()) {
    accels[accelIndex][0] = accel.getRawX() + 32768;
    accels[accelIndex][1] = accel.getRawY() + 32768;
    accels[accelIndex][2] = accel.getRawZ() + 32768;
    accelIndex++;

    // debug output
    // Serial.print("X: ");
    // Serial.print(accels[accelIndex][0]);
    // Serial.print(" Y: ");
    // Serial.print(accels[accelIndex][1]);
    // Serial.print(" Z: ");
    // Serial.println(accels[accelIndex][2]);

    if (accelIndex >= ACCEL_SAMPLES) {
      accelIndex = 0;
      // cal variance
      uint64_t avg[3] = {0, 0, 0};
      for (int i = 0; i < ACCEL_SAMPLES; i++) {
        avg[0] += accels[i][0];
        avg[1] += accels[i][1];
        avg[2] += accels[i][2];
      }
      avg[0] /= ACCEL_SAMPLES;
      avg[1] /= ACCEL_SAMPLES;
      avg[2] /= ACCEL_SAMPLES;
      uint64_t var[3] = {0, 0, 0};
      for (int i = 0; i < ACCEL_SAMPLES; i++) {
        var[0] += (accels[i][0] - avg[0]) * (accels[i][0] - avg[0]);
        var[1] += (accels[i][1] - avg[1]) * (accels[i][1] - avg[1]);
        var[2] += (accels[i][2] - avg[2]) * (accels[i][2] - avg[2]);
      }
      var[0] /= ACCEL_SAMPLES;
      var[1] /= ACCEL_SAMPLES;
      var[2] /= ACCEL_SAMPLES;
      // debug output
      // Serial.print("variance: ");
      // Serial.print(var[0]);
      // Serial.print(" ");
      // Serial.print(var[1]);
      // Serial.print(" ");
      // Serial.println(var[2]);

      int varThreshold = WAKEUPthreshold * 10000;

      if (var[0] > varThreshold || var[1] > varThreshold ||
          var[2] > varThreshold) {
        handleMoved = true;
        //      Serial.println("进入工作状态!");
      }
    }
  }

  // #endif

  if (SensorCounter++ > 10) {
    Vin = getVIN();  // get Vin every now and then 时不时去获取VIN电压
    SensorCounter = 0;
  }

}

void measureTipTemp(){
  ledcWrite(CONTROL_CHANNEL,
            HEATER_OFF);  // shut off heater in order to measure
                          // temperature 关闭加热器以测量温度
  if (VoltageValue == 3) {
    delay(TIME2SETTLE_20V/1000);
  } else {
    delay(TIME2SETTLE/1000);  // wait for voltage to settle 等待电压稳定
  }
  long timems = millis();
  auto temp = denoiseAnalog(SENSOR_PIN);  // 读取ADC值的温度
  lastMillis = millis() - timems;
  // Serial.println(lastMillis);

  RawTemp += (temp - RawTemp) *
             SMOOTHIE;  // stabilize ADC temperature reading 稳定ADC温度读数
  calculateTemp();  // calculate real temperature value 计算实际温度值

  // stabilize displayed temperature when around setpoint
  // 稳定显示温度时，周围的设定值
  if ((ShowTemp != Setpoint) || (abs(ShowTemp - CurrentTemp) > 1))
    ShowTemp = CurrentTemp;
  if (abs(ShowTemp - Setpoint) <= 1) ShowTemp = Setpoint;
  if (inLockMode) {
    ShowTemp = 0;
  }

  // set state variable if temperature is in working range; beep if working
  // temperature was just reached
  // 温度在工作范围内可设置状态变量;当工作温度刚刚达到时，会发出蜂鸣声
  gap = abs(SetTemp - CurrentTemp);
  if (gap < 5) {
    if (!isWorky && beepIfWorky) beep();
    isWorky = true;
    beepIfWorky = false;
  } else
    isWorky = false;

  // checks if tip is present or currently inserted
  // 检查烙铁头是否存在或当前已插入
  if (ShowTemp > 500) TipIsPresent = false;  // tip removed ? 烙铁头移除？
  if (!TipIsPresent &&
      (ShowTemp < 500)) {  // new tip inserted ? 新的烙铁头插入？
    ledcWrite(CONTROL_CHANNEL, HEATER_OFF);  // shut off heater 关闭加热器
    beep();                                  // beep for info
    TipIsPresent = true;  // tip is present now 烙铁头已经存在
    ChangeTipScreen();  // show tip selection screen 显示烙铁头选择屏幕
    update_EEPROM();     // update setting in EEPROM EEPROM的更新设置
    handleMoved = true;  // reset all timers 重置所有计时器
    RawTemp = denoiseAnalog(SENSOR_PIN);  // restart temp smooth algorithm 重启临时平滑算法
    c0 = LOW;         // switch must be released 必须松开开关
    setRotary(TEMP_MIN, TEMP_MAX, TEMP_STEP,
              SetTemp);  // reset rotary encoder 重置旋转编码器
  }
}

// calculates real temperature value according to ADC reading and calibration
// values 根据ADC读数和校准值，计算出真实的温度值
void calculateTemp() {
  if (RawTemp < 200)
    CurrentTemp = map(RawTemp, 0, 200, 15, CalTemp[CurrentTip][0]);
  else if (RawTemp < 280)
    CurrentTemp =
        map(RawTemp, 200, 280, CalTemp[CurrentTip][0], CalTemp[CurrentTip][1]);
  else
    CurrentTemp =
        map(RawTemp, 280, 360, CalTemp[CurrentTip][1], CalTemp[CurrentTip][2]);
}

// controls the heater 控制加热器
void Thermostat() {
  // define Setpoint according to current working mode
  // 根据当前工作模式定义设定值
  if (inOffMode || inLockMode)
    Setpoint = 0;
  else if (inSleepMode)
    Setpoint = SleepTemp;
  else if (inBoostMode) {
    Setpoint = constrain(SetTemp + BoostTemp, 0, TEMP_MAX);
  } else
    Setpoint = SetTemp;

  if (SetTemp != DefaultTemp) {
    DefaultTemp = SetTemp;  // 把设置里面的默认温度也修改了
    update_default_temp_EEPROM();
  }

  // measure tip temperature
  measureTipTemp();

  // control the heater (PID or direct) 控制加热器(PID或直接)
  gap = abs(Setpoint - CurrentTemp);
  if (PIDenable && gap < PID_ENABLE_GAP) {
    Input = CurrentTemp;
    Output = ctrl.step(Setpoint, Input);
/*
    if (gap < 30)
      ctrl.SetTunings(consKp, consKi, consKd);
    else
      ctrl.SetTunings(aggKp, aggKi, aggKd);
    ctrl.Compute();
*/
  } else {
    // reset PID
    ctrl.clear();
    // turn on heater if current temperature is below setpoint
    // 如果当前温度低于设定值，则打开加热器
    if ((CurrentTemp + 0.5) < Setpoint)
      Output = 255;
    else
      Output = 0;
  }
  pwm_limit = POWER_LIMIT_20;
  if (VoltageValue < 3) {
    pwm_limit = POWER_LIMIT_15;
  } else if(VoltageValue == 3){
    pwm_limit = POWER_LIMIT_20_2;
  }

  uint32_t t = constrain((HEATER_PWM), 0, pwm_limit);
  //uint32_t pwm = ledcRead(CONTROL_CHANNEL);
  ledcWrite(CONTROL_CHANNEL, t);  // set heater PWM 设置加热器PWM
  Serial.printf("PWM:%u, ms:%u\n", t, millis());

  pidmillis = millis();
}

// creates a short beep on the buzzer 在蜂鸣器上创建一个短的哔哔声
void beep() {
  if (beepEnable) {
    for (uint8_t i = 0; i < 255; i++) {
      digitalWrite(BUZZER_PIN, HIGH);
      delayMicroseconds(125);
      digitalWrite(BUZZER_PIN, LOW);
      delayMicroseconds(125);
    }
  }
}

// sets start values for rotary encoder 设置旋转编码器的起始值
void setRotary(int rmin, int rmax, int rstep, int rvalue) {
  countMin = rmin << ROTARY_TYPE;
  countMax = rmax << ROTARY_TYPE;
  countStep = rstep;
  count = rvalue << ROTARY_TYPE;
}

// reads current rotary encoder value 读取当前旋转编码器值
int getRotary() {
  Button_loop();
  return (count >> ROTARY_TYPE);
}

// reads user settings from EEPROM; if EEPROM values are invalid, write defaults
// 从EEPROM读取用户设置;如果EEPROM值无效，则写入默认值
void getEEPROM() { read_EEPROM(); }

// draws the main screen 绘制主屏幕
void MainScreen() {
  u8g2.firstPage();
  do {
    // u8g2.setCursor(0, 0);
    // u8g2.print(F("nihao"));
    //  draw setpoint temperature
    u8g2.setFont(PTS200_16);
    if(language == 2){
      u8g2.setFont(u8g2_font_unifont_t_chinese3);
    }
    u8g2.setFontPosTop();
    //    u8g2.drawUTF8(0, 0 + SCREEN_OFFSET, "设温:");
    u8g2.drawUTF8(0, 0 + SCREEN_OFFSET, txt_set_temp[language]);
    u8g2.setCursor(40, 0 + SCREEN_OFFSET);
    u8g2.setFont(u8g2_font_unifont_t_chinese3);
    u8g2.print(Setpoint, 0);

    u8g2.setFont(PTS200_16);
    if(language == 2){
      u8g2.setFont(u8g2_font_unifont_t_chinese3);
    }
    // draw status of heater 绘制加热器状态
    u8g2.setCursor(96, 0 + SCREEN_OFFSET);
    if (ShowTemp > 500)
      u8g2.print(txt_error[language]);
    else if (inOffMode || inLockMode)
      u8g2.print(txt_off[language]);
    else if (inSleepMode)
      u8g2.print(txt_sleep[language]);
    else if (inBoostMode)
      u8g2.print(txt_boost[language]);
    else if (isWorky)
      u8g2.print(txt_worky[language]);
    else if (Output < 180)
      u8g2.print(txt_on[language]);
    else
      u8g2.print(txt_hold[language]);

    u8g2.setFont(u8g2_font_unifont_t_chinese3);
    // rest depending on main screen type 休息取决于主屏幕类型
    if (MainScrType) {
      // draw current tip and input voltage 绘制当前烙铁头及输入电压
      float fVin = (float)Vin / 1000;  // convert mv in V
      newSENSORTmp = newSENSORTmp + 0.01 * getAccellTemp();
      SENSORTmpTime++;
      if (SENSORTmpTime >= 100) {
        lastSENSORTmp = newSENSORTmp;
        newSENSORTmp = 0;
        SENSORTmpTime = 0;
      }
      u8g2.setCursor(0, 50);
      u8g2.print(lastSENSORTmp, 1);
      u8g2.print(F("C"));
      u8g2.setCursor(83, 50);
      u8g2.print(fVin, 1);
      u8g2.print(F("V"));
      // draw current temperature 绘制当前温度
      u8g2.setFont(u8g2_font_freedoomr25_tn);
      u8g2.setFontPosTop();
      u8g2.setCursor(37, 18);
      if (ShowTemp > 500)
        u8g2.print(F("000"));
      else
        u8g2.printf("%03d", ShowTemp);
    } else {
      // draw current temperature in big figures 用大数字绘制当前温度
      u8g2.setFont(u8g2_font_fub42_tn);
      u8g2.setFontPosTop();
      u8g2.setCursor(15, 20);
      if (ShowTemp > 500)
        u8g2.print(F("000"));
      else
        u8g2.printf("%03d", ShowTemp);
    }
  } while (u8g2.nextPage());
}

// setup screen 设置屏幕
void SetupScreen() {
  ledcWrite(CONTROL_CHANNEL, HEATER_OFF);  // shut off heater
  beep();
  uint16_t SaveSetTemp = SetTemp;
  uint8_t selection = 0;
  bool repeat = true;

  while (repeat) {
    selection = MenuScreen(SetupItems, sizeof(SetupItems), selection);
    switch (selection) {
      case 0: {
        TipScreen();
        repeat = false;
      } break;
      case 1: {
        TempScreen();
      } break;
      case 2: {
        TimerScreen();
      } break;
        //      case 3:
        //        PIDenable = MenuScreen(ControlTypeItems,
        //        sizeof(ControlTypeItems), PIDenable); break;
      case 3: {
        MainScrType =
            MenuScreen(MainScreenItems, sizeof(MainScreenItems), MainScrType);
      } break;
      case 4: {
        InfoScreen();
      } break;
      case 5:
        VoltageValue =
            MenuScreen(VoltageItems, sizeof(VoltageItems), VoltageValue);
        PD_Update();
        break;
      case 6:
        QCEnable = MenuScreen(QCItems, sizeof(QCItems), QCEnable);
        break;
      case 7:
        beepEnable = MenuScreen(BuzzerItems, sizeof(BuzzerItems), beepEnable);
        break;
      case 8: {
        restore_default_config = MenuScreen(DefaultItems, sizeof(DefaultItems),
                                            restore_default_config);
        if (restore_default_config) {
          restore_default_config = false;
          write_default_EEPROM();
          read_EEPROM();
        }
      } break;
      case 9: {
        bool lastbutton = (!digitalRead(BUTTON_PIN));
        u8g2.clearBuffer();                  // clear the internal memory
        u8g2.setFont(u8g2_font_ncenB08_tr);  // choose a suitable font
        u8g2.drawStr(0, 10,
                     "MSC Update");  // write something to the internal memory
        u8g2.sendBuffer();           // transfer internal memory to the display
        delay(1000);
        do {
          MSC_Update.onEvent(usbEventCallback);
          MSC_Update.begin();
          if (lastbutton && digitalRead(BUTTON_PIN)) {
            delay(10);
            lastbutton = false;
          }
        } while (digitalRead(BUTTON_PIN) || lastbutton);

        MSC_Update.end();
      } break;
      case 10: {
        Serial.println(language);
        language = MenuScreen(LanguagesItems, sizeof(LanguagesItems), language);
        Serial.println(language);
        repeat = false;
      } break;
      case 11: {
        if(hand_side == 0){
          u8g2.setDisplayRotation(U8G2_R3);
          hand_side = 1;
        }else{
          u8g2.setDisplayRotation(U8G2_R1);
          hand_side = 0;
        }
        repeat = false;
      } break;
      default:
        repeat = false;
        break;
    }
  }
  update_EEPROM();
  handleMoved = true;
  SetTemp = SaveSetTemp;
  setRotary(TEMP_MIN, TEMP_MAX, TEMP_STEP, SetTemp);
}

// tip settings screen 烙铁头设置屏幕
void TipScreen() {
  uint8_t selection = 0;
  bool repeat = true;
  while (repeat) {
    selection = MenuScreen(TipItems, sizeof(TipItems), selection);
    switch (selection) {
      case 0:
        ChangeTipScreen();
        break;
      case 1:
        CalibrationScreen();
        break;
      case 2:
        InputNameScreen();
        break;
      case 3:
        DeleteTipScreen();
        break;
      case 4:
        AddTipScreen();
        break;
      default:
        repeat = false;
        break;
    }
  }
}

// temperature settings screen 温度设置屏幕
void TempScreen() {
  uint8_t selection = 0;
  bool repeat = true;
  while (repeat) {
    selection = MenuScreen(TempItems, sizeof(TempItems), selection);
    switch (selection) {
      case 0:
        setRotary(TEMP_MIN, TEMP_MAX, TEMP_STEP, DefaultTemp);
        DefaultTemp = InputScreen(DefaultTempItems);
        break;
      case 1:
        setRotary(50, TEMP_MAX, TEMP_STEP, SleepTemp);
        SleepTemp = InputScreen(SleepTempItems);
        break;
      case 2:
        setRotary(10, 100, TEMP_STEP, BoostTemp);
        BoostTemp = InputScreen(BoostTempItems);
        break;
      default:
        repeat = false;
        break;
    }
  }
}

